## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_application_insights.main must be replaced
-/+ resource "azurerm_application_insights" "main" {
      ~ app_id                                = "1096c6c5-c4d4-44d6-97a1-85fdb24bb39c" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.Insights/components/appi-private-chatgpt-aydgnqft" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "appi-private-chatgpt-aydgnqft" -> "appi-private-chatgpt-aydgnqft}" # forces replacement
      - tags                                  = {} -> null
        # (10 unchanged attributes hidden)
    }

  # azurerm_cognitive_account.main will be updated in-place
  ~ resource "azurerm_cognitive_account" "main" {
        id                                 = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.CognitiveServices/accounts/oai-private-chatgpt-aydgnqft"
        name                               = "oai-private-chatgpt-aydgnqft"
        tags                               = {}
        # (13 unchanged attributes hidden)

      - network_acls {
          - default_action = "Allow" -> null
          - ip_rules       = [] -> null
        }

        # (1 unchanged block hidden)
    }

  # azurerm_cosmosdb_account.main will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "main" {
        id                                       = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-private-chatgpt-aydgnqft"
        name                                     = "cosmos-private-chatgpt-aydgnqft"
        tags                                     = {}
        # (27 unchanged attributes hidden)

      - geo_location {
          - failover_priority = 1 -> null
          - id                = "cosmos-private-chatgpt-aydgnqft-westus" -> null
          - location          = "westus" -> null
          - zone_redundant    = false -> null
        }

        # (5 unchanged blocks hidden)
    }

  # azurerm_cosmosdb_sql_container.example will be destroyed
  # (because azurerm_cosmosdb_sql_container.example is not in configuration)
  - resource "azurerm_cosmosdb_sql_container" "example" {
      - account_name          = "cosmos-private-chatgpt-aydgnqft" -> null
      - database_name         = "cosmos-sql-db" -> null
      - id                    = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-private-chatgpt-aydgnqft/sqlDatabases/cosmos-sql-db/containers/app-container" -> null
      - name                  = "app-container" -> null
      - partition_key_path    = "/id" -> null
      - partition_key_version = 2 -> null
      - resource_group_name   = "rg-private-chatgpt-aydgnqft-application" -> null
      - throughput            = 400 -> null

      - conflict_resolution_policy {
          - conflict_resolution_path = "/_ts" -> null
          - mode                     = "LastWriterWins" -> null
        }

      - indexing_policy {
          - indexing_mode = "consistent" -> null

          - excluded_path {
              - path = "/excluded/?" -> null
            }

          - included_path {
              - path = "/*" -> null
            }
          - included_path {
              - path = "/included/?" -> null
            }
        }

      - unique_key {
          - paths = [
              - "/definition/idlong",
              - "/definition/idshort",
            ] -> null
        }
    }

  # azurerm_cosmosdb_sql_container.sessions will be created
  + resource "azurerm_cosmosdb_sql_container" "sessions" {
      + account_name          = "cosmos-private-chatgpt-aydgnqft"
      + database_name         = "cosmos-sql-private-chatgpt-aydgnqft"
      + default_ttl           = (known after apply)
      + id                    = (known after apply)
      + name                  = "sessions"
      + partition_key_path    = "/userId"
      + partition_key_version = 1
      + resource_group_name   = "rg-private-chatgpt-aydgnqft-application"
      + throughput            = 400

      + indexing_policy {
          + indexing_mode = "consistent"

          + excluded_path {
              + path = "/excluded/?"
            }

          + included_path {
              + path = "/*"
            }
          + included_path {
              + path = "/included/?"
            }
        }
    }

  # azurerm_cosmosdb_sql_container.users will be created
  + resource "azurerm_cosmosdb_sql_container" "users" {
      + account_name          = "cosmos-private-chatgpt-aydgnqft"
      + database_name         = "cosmos-sql-private-chatgpt-aydgnqft"
      + default_ttl           = (known after apply)
      + id                    = (known after apply)
      + name                  = "users"
      + partition_key_path    = "/id"
      + partition_key_version = 1
      + resource_group_name   = "rg-private-chatgpt-aydgnqft-application"
      + throughput            = 400

      + indexing_policy {
          + indexing_mode = "consistent"

          + excluded_path {
              + path = "/excluded/?"
            }

          + included_path {
              + path = "/*"
            }
          + included_path {
              + path = "/included/?"
            }
        }
    }

  # azurerm_cosmosdb_sql_database.main must be replaced
-/+ resource "azurerm_cosmosdb_sql_database" "main" {
      ~ id                  = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-private-chatgpt-aydgnqft/sqlDatabases/cosmos-sql-db" -> (known after apply)
      ~ name                = "cosmos-sql-db" -> "cosmos-sql-private-chatgpt-aydgnqft" # forces replacement
      ~ throughput          = 0 -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_linux_function_app.main will be created
  + resource "azurerm_linux_function_app" "main" {
      + app_settings                      = (known after apply)
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + hosting_environment_id            = (known after apply)
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "eastus"
      + name                              = "func-private-chatgpt-aydgnqft"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + public_network_access_enabled     = true
      + resource_group_name               = "rg-private-chatgpt-aydgnqft-application"
      + service_plan_id                   = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.Web/serverfarms/asp-private-chatgpt-aydgnqft"
      + site_credential                   = (sensitive value)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = "stprivatechatgptaydgnqft"
      + storage_uses_managed_identity     = false
      + tags                              = (known after apply)
      + zip_deploy_file                   = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + application_insights_connection_string  = (sensitive value)
          + application_insights_key                = (sensitive value)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + python_version              = "3.9"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # azurerm_linux_web_app.main will be updated in-place
  ~ resource "azurerm_linux_web_app" "main" {
      ~ app_settings                      = {
          - "APPINSIGHTS_INSTRUMENTATIONKEY"             = (sensitive value)
          - "APPINSIGHTS_PROFILERFEATURE_VERSION"        = "1.0.0"
          - "APPINSIGHTS_SNAPSHOTFEATURE_VERSION"        = "1.0.0"
          - "APPLICATIONINSIGHTS_CONNECTION_STRING"      = (sensitive value)
          - "AZURE_OPENAI_API_INSTANCE_NAME"             = "private-chatgpt-aydgnqft"
          - "ApplicationInsightsAgent_EXTENSION_VERSION" = "~2"
          - "COSMOS_ENDPOINT"                            = "https://cosmos-private-chatgpt-aydgnqft.documents.azure.com:443/"
          - "DiagnosticServices_EXTENSION_VERSION"       = "~3"
          - "KEY_VAULT_URI"                              = "https://kvprivatechatgptaydgnqft.vault.azure.net/"
        } -> (known after apply)
        id                                = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.Web/sites/app-private-chatgpt-aydgnqft"
        name                              = "app-private-chatgpt-aydgnqft"
        tags                              = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_role_assignment.cognitive_services_contributor will be created
  + resource "azurerm_role_assignment" "cognitive_services_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.CognitiveServices/accounts/oai-private-chatgpt-aydgnqft"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.cosmos_contributor will be created
  + resource "azurerm_role_assignment" "cosmos_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DocumentDB Account Contributor"
      + scope                            = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-private-chatgpt-aydgnqft"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.linux_web_app_key_vault_secrets_user will be destroyed
  # (because azurerm_role_assignment.linux_web_app_key_vault_secrets_user is not in configuration)
  - resource "azurerm_role_assignment" "linux_web_app_key_vault_secrets_user" {
      - id                   = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.KeyVault/vaults/kvprivatechatgptaydgnqft/providers/Microsoft.Authorization/roleAssignments/8047f8cf-0943-bf95-4300-da4973b5c7dd" -> null
      - name                 = "8047f8cf-0943-bf95-4300-da4973b5c7dd" -> null
      - principal_id         = "a037cbe1-1991-4d8d-ba5a-44f01c7871db" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
      - role_definition_name = "Key Vault Secrets User" -> null
      - scope                = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.KeyVault/vaults/kvprivatechatgptaydgnqft" -> null
    }

  # azurerm_role_assignment.storage_blob_data_contibutor will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contibutor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DocumentDB Account Contributor"
      + scope                            = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.Storage/storageAccounts/stprivatechatgptaydgnqft"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.storage_blob_data_contributor will be destroyed
  # (because azurerm_role_assignment.storage_blob_data_contributor is not in configuration)
  - resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      - id                   = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.Storage/storageAccounts/stprivatechatgptaydgnqft/providers/Microsoft.Authorization/roleAssignments/6b49450a-e8aa-a320-c60c-37f289232132" -> null
      - name                 = "6b49450a-e8aa-a320-c60c-37f289232132" -> null
      - principal_id         = "0846d5e0-d7f8-4efc-9bb4-1df8ed96e744" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> null
      - role_definition_name = "Storage Blob Data Contributor" -> null
      - scope                = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.Storage/storageAccounts/stprivatechatgptaydgnqft" -> null
    }

  # azurerm_service_plan.main will be updated in-place
  ~ resource "azurerm_service_plan" "main" {
        id                           = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.Web/serverfarms/asp-private-chatgpt-aydgnqft"
        name                         = "asp-private-chatgpt-aydgnqft"
      ~ sku_name                     = "P1v3" -> "Y1"
        tags                         = {}
        # (9 unchanged attributes hidden)
    }

  # azurerm_storage_blob.function_app_code will be created
  + resource "azurerm_storage_blob" "function_app_code" {
      + access_tier            = (known after apply)
      + content_md5            = "aee5b1ae7c0d2559a2d4d2c003fa60f7"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "function-code.zip"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./function-code.zip"
      + storage_account_name   = "stprivatechatgptaydgnqft"
      + storage_container_name = "function-releases"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_container.app_builds will be created
  + resource "azurerm_storage_container" "app_builds" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "app-builds"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "stprivatechatgptaydgnqft"
    }

  # azurerm_storage_container.function_releases will be created
  + resource "azurerm_storage_container" "function_releases" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "function-releases"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "stprivatechatgptaydgnqft"
    }

  # azurerm_storage_container.main will be destroyed
  # (because azurerm_storage_container.main is not in configuration)
  - resource "azurerm_storage_container" "main" {
      - container_access_type   = "private" -> null
      - has_immutability_policy = false -> null
      - has_legal_hold          = false -> null
      - id                      = "https://stprivatechatgptaydgnqft.blob.core.windows.net/app-builds" -> null
      - metadata                = {} -> null
      - name                    = "app-builds" -> null
      - resource_manager_id     = "/subscriptions/d003ea48-de34-4898-8ad4-daa31fd6479c/resourceGroups/rg-private-chatgpt-aydgnqft-application/providers/Microsoft.Storage/storageAccounts/stprivatechatgptaydgnqft/blobServices/default/containers/app-builds" -> null
      - storage_account_name    = "stprivatechatgptaydgnqft" -> null
    }

Plan: 11 to add, 4 to change, 6 to destroy.
```
</details>